In [58]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### **dim_date.csv**

In [59]:
dim_date = pd.read_csv('./datasets/dim_date.csv')
dim_date.head()

        date  fiscal_year quarter
0  01-Apr-21         2022      Q1
1  01-May-21         2022      Q1
2  01-Jun-21         2022      Q1
3  01-Jul-21         2022      Q2
4  01-Aug-21         2022      Q2

In [60]:
dim_date.dtypes

date           object
fiscal_year     int64
quarter        object
dtype: object

#### Extracting month, month name, and year from date column

In [61]:
dim_date['date'] = pd.to_datetime(dim_date['date'], format='%d-%b-%y')

dim_date['date_month'] = dim_date['date'].dt.month
dim_date['date_year'] = dim_date['date'].dt.year
dim_date['date_month_name'] = dim_date['date'].dt.strftime('%B')

In [62]:
dim_date.head()

        date  fiscal_year quarter  date_month  date_year date_month_name
0 2021-04-01         2022      Q1           4       2021           April
1 2021-05-01         2022      Q1           5       2021             May
2 2021-06-01         2022      Q1           6       2021            June
3 2021-07-01         2022      Q2           7       2021            July
4 2021-08-01         2022      Q2           8       2021          August

In [63]:
dim_date.isnull().sum()

date               0
fiscal_year        0
quarter            0
date_month         0
date_year          0
date_month_name    0
dtype: int64

In [64]:
dim_date.duplicated().sum()

np.int64(0)

#### No null and duplicate values

### **electric_vehicle_sales_by_makers.csv**

In [65]:
makers = pd.read_csv('./datasets/electric_vehicle_sales_by_makers.csv')
makers.head()

        date vehicle_category         maker  electric_vehicles_sold
0  01-Apr-21       2-Wheelers  OLA ELECTRIC                       0
1  01-Apr-22       2-Wheelers      OKAYA EV                       0
2  01-May-21       2-Wheelers  OLA ELECTRIC                       0
3  01-Jun-21       2-Wheelers  OLA ELECTRIC                       0
4  01-Jul-21       2-Wheelers  OLA ELECTRIC                       0

In [66]:
makers.isna().sum()

date                      0
vehicle_category          0
maker                     0
electric_vehicles_sold    0
dtype: int64

In [67]:
makers.duplicated().sum()

np.int64(0)

#### No null and duplicate values

In [68]:
makers_2_wheelers = makers[makers['vehicle_category'] == '2-Wheelers']
makers_4_wheelers = makers[makers['vehicle_category'] == '4-Wheelers']

In [69]:
makers_2_wheelers.to_csv('./datasets/makers_2_wheelers.csv', index=False)
makers_4_wheelers.to_csv('./datasets/makers_4_wheelers.csv', index=False)

### **electric_vehicle_sales_by_state.csv**

In [70]:
state = pd.read_csv('./datasets/electric_vehicle_sales_by_state.csv')
state.head()

,date,state,vehicle_category,electric_vehicles_sold,total_vehicles_sold
0,01-Apr-21,Sikkim,2-Wheelers,0,398
1,01-Apr-21,Sikkim,4-Wheelers,0,361
2,01-May-21,Sikkim,2-Wheelers,0,113
3,01-May-21,Sikkim,4-Wheelers,0,98
4,01-Jun-21,Sikkim,2-Wheelers,0,229

In [71]:
state.isna().sum()

date                      0
state                     0
vehicle_category          0
electric_vehicles_sold    0
total_vehicles_sold       0
dtype: int64

In [72]:
state.duplicated().sum()

np.int64(0)

#### No duplicate and null values

In [73]:
state_2_wheelers = state[state['vehicle_category'] == '2-Wheelers']
state_4_wheelers = state[state['vehicle_category'] == '4-Wheelers']

In [74]:
state_2_wheelers.to_csv('./datasets/state_2_wheelers.csv', index=False)
state_4_wheelers.to_csv('./datasets/state_4_wheelers.csv', index=False)